examples/04_piston_flow/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topOpen
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    bottomWall
    {
        type            zeroGradient;
    }

    contractionWall
    {
        type            noSlip;
    }

    xMinWall
    {
        type            noSlip;
    }

    xMaxWall
    {
        type            noSlip;
    }

    zMinWall
    {
        type            noSlip;
    }

    zMaxWall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
