examples/04_piston_flow/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topOpen
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type fixedValue;
        value uniform 0;
    }

    contractionWall
    {
        type            zeroGradient;
    }
    
    xMinWall
    {
        type            zeroGradient;
    }

    xMaxWall
    {
        type            zeroGradient;
    }

    zMinWall
    {
        type            zeroGradient;
    }

    zMaxWall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
