examples/04_piston_flow/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

// ************************************************************************* //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topOpen
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    contractionWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    xMinWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    xMaxWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    zMinWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    zMaxWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
